---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.AlphanumericRevisionSettings
source: html/7a8c7c6c-e63d-ef29-b1ee-e14e0f81d7f9.htm
---
# AlphanumericRevisionSettings Members

Constructs an AlphanumericRevisionSettings with a simple, default sequence.